import { AppData } from './types';

export const RAW_DATA: AppData = {
  "research_info": {
    "name": "航旅纵横-民航官方直销平台",
    "type": "mobile_app",
    "version": "8.3.4",
    "description": "一款民航出行服务应用"
  },
  "reviews": [
    {
      "author": "犹豫的达芬奇",
      "rating": 1,
      "title": "差评",
      "content": "我想取消值机，找半天找不到，去小红书上搜才能搜到，而且也没有人工客服，取消值机找半天？请问入口隐藏这么深干什么",
      "version": "8.3.4",
      "date": "2025-11-20T23:32:30-07:00"
    },
    {
      "author": "首飞成功",
      "rating": 1,
      "title": "仓位图",
      "content": "最近仓位图看不到具体情况，差评",
      "version": "8.3.4",
      "date": "2025-11-20T03:49:07-07:00"
    },
    {
      "author": "你叔叔的兄弟",
      "rating": 1,
      "title": "想被骗到内裤都不剩的就下载这个APP吧",
      "content": "在这个APP上买过两次机票往返的 因为他们自己的原因通知我们航班取消 自此之后一直有诈骗电话打进来 说的就是我在这个APP被取消的那个航班 一直不停的打诈骗电话给我 这个APP外包客户信息卖给诈骗集团",
      "version": "8.3.4",
      "date": "2025-11-20T02:39:19-07:00"
    },
    {
      "author": "无wuwu语",
      "rating": 1,
      "title": "超烂！",
      "content": "超烂哈 上面约车 自己说一口价 然后司机额外收费 客服不是一口价 给他看订单上面清清楚楚标注一口价 又立马改口说这是一口价  差评！",
      "version": "8.3.4",
      "date": "2025-11-19T21:00:09-07:00"
    },
    {
      "author": "鼓鼓生风",
      "rating": 1,
      "title": "泄露客户信息，导致境外诈骗电话频繁骚扰",
      "content": "订完机票就收到境外电话频繁诈骗，这APP是和东南亚诈骗园区合作了吗？",
      "version": "8.3.4",
      "date": "2025-11-17T21:05:45-07:00"
    },
    {
      "author": "jjdhdhdbdnsjsj",
      "rating": 1,
      "title": "无",
      "content": "改版后莫名其妙时间一到就显示机上模式，仓位信息什么全看不到了",
      "version": "8.3.4",
      "date": "2025-11-17T20:59:43-07:00"
    },
    {
      "author": "迪拜国际米兰队",
      "rating": 1,
      "title": "登机口信息差的离谱",
      "content": "迪拜转机登机口信息错的离谱啊🧐",
      "version": "8.3.4",
      "date": "2025-11-16T19:36:55-07:00"
    },
    {
      "author": "🆚🆚🈚️",
      "rating": 4,
      "title": "体验差",
      "content": "每次打开app都得输入密码，不能简化一下吗？",
      "version": "8.3.4",
      "date": "2025-11-15T15:49:50-07:00"
    },
    {
      "author": "impression",
      "rating": 2,
      "title": "关机重启一次就要重新登录一次",
      "content": "关机重启一次就要重新登录一次，真的很垃圾",
      "version": "8.3.3",
      "date": "2025-11-14T00:29:14-07:00"
    },
    {
      "author": "ZRoc1",
      "rating": 2,
      "title": "掼蛋就这么重要吗",
      "content": "掼蛋就这么重要吗，飞行时不停提醒我，关都关不掉，作为一个官方app，该行为好搞笑",
      "version": "8.3.3",
      "date": "2025-11-11T23:00:06-07:00"
    },
    {
      "author": "atshogs",
      "rating": 1,
      "title": "界面字体太小",
      "content": "界面字体太小，且没法设置，也没有关怀模式。五十岁仍然是航空出行主力，但看这个APP很很费劲。",
      "version": "8.3.3",
      "date": "2025-11-11T02:29:54-07:00"
    },
    {
      "author": "zzmomof",
      "rating": 1,
      "title": "不能关闭开屏摇一摇广告",
      "content": "不能关闭开屏摇一摇广告，一不小心就跳转，太烦了",
      "version": "8.3.3",
      "date": "2025-11-08T00:43:13-07:00"
    },
    {
      "author": "小浮promax",
      "rating": 2,
      "title": "客服不接电话",
      "content": "从早打到晚，客服不接电话，你们客服电话是装饰吗",
      "version": "8.3.3",
      "date": "2025-11-07T03:52:46-07:00"
    },
    {
      "author": "马路莱鸟",
      "rating": 1,
      "title": "不显示机票价格拒不给行程单",
      "content": "🌶︎🐔超难用！",
      "version": "8.3.2",
      "date": "2025-11-01T22:18:57-07:00"
    },
    {
      "author": "stuarth_",
      "rating": 1,
      "title": "广告",
      "content": "打开app有广告，开了会员也有，最讨厌的是广告还要自动占用播放功能，别的正在后台播放的内容会被自动暂停",
      "version": "8.3.2",
      "date": "2025-10-27T21:21:30-07:00"
    },
    {
      "author": "马新军提交",
      "rating": 4,
      "title": "个人意见",
      "content": "航旅纵横用了几年了，一步一步越来越完善，功能越来越强大，远超其他app。\n个人意见就是把界面做做清爽，太杂太乱。功能板块职能不清晰。譬如，点开app最主要功能就是值机和看航班信息，就不要参进旅游，各种商品信息，城市介绍等，最多加个天气预报，各种约车等。然后购票放另外一个板块，城市旅游，住宿，门票等放一个板块，真的很乱。个人愚见，有点不如非常准",
      "version": "8.3.2",
      "date": "2025-10-27T05:45:18-07:00"
    },
    {
      "author": "我是Zoe zoe",
      "rating": 1,
      "title": "一直弹出蓝牙请求",
      "content": "提示发现50个蓝牙设备，无法取消蓝牙请求弹窗",
      "version": "8.3.2",
      "date": "2025-10-26T04:39:03-07:00"
    },
    {
      "author": "一个愤怒的用户",
      "rating": 1,
      "title": "垃圾中的垃圾",
      "content": "垃圾app，吞我退票费，4个人的机票，航空公司小程序上退了自己的，其他人只能在航旅纵横上退，退票政策没变，前后时间不到5分钟，一个人少退20多。",
      "version": "8.3.2",
      "date": "2025-10-22T02:28:06-07:00"
    },
    {
      "author": "Aom1ne23",
      "rating": 4,
      "title": "支付模式增加",
      "content": "能不能开通云闪付或者微信支付就更完美了！！！",
      "version": "8.3.3",
      "date": "2025-11-06T02:47:31-07:00"
    }
  ]
};
